Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Since you're overriding a virtual method, we suggest adding the `override` keyword.
it_it: Poiché si sta sovrascrivendo [overriding] un metodo virtuale, suggeriamo di aggiungere la parola chiave `override`.

source: Since your production code doesn't link in the for-test logic at all (the testonly attribute for BUILD targets helps to ensure that), there is no danger in accidentally running it.
it_it: Poiché il codice di produzione non si collega affatto alla logica for-test (l'attributo testonly per i target BUILD aiuta a garantirlo), non c'è pericolo di eseguirlo accidentalmente.

source: Since your production code doesn't link in the for-test logic at all (the [`testonly`](https://docs.bazel.build/versions/master/be/common-definitions.html#common.testonly) attribute for BUILD targets helps to ensure that), there is no danger in accidentally running it.
it_it: Poiché il codice di produzione non si collega affatto alla logica for-test (l'attributo [`testonly`](https://docs.bazel.build/versions/master/be/common-definitions.html#common.testonly) per i target BUILD aiuta a garantirlo), non c'è pericolo di eseguirlo accidentalmente.

source: Skipping test execution
it_it: Saltare l'esecuzione del test

source: So the answer is that we think it's better to show the warning.
it_it: Quindi la risposta è che pensiamo sia meglio mostrare il warning.

source: So basically *`statement`* can be any C++ statement that makes sense in the current context.
it_it: Quindi, in pratica *`statement`* può essere qualsiasi istruzione C++ che abbia senso nel contesto corrente.

source: So basically statement can be any C++ statement that makes sense in the current context.
it_it: Quindi, in pratica statement può essere qualsiasi istruzione C++ che abbia senso nel contesto corrente.

source: So clearly TestSuiteName and TestName cannot start or end with _ (Actually, TestSuiteName can start with _—as long as the _ isn't followed by an upper-case letter.
it_it: Quindi chiaramente TestSuiteName e TestName non possono iniziare o finire con _ (In realtà, TestSuiteName può iniziare con _—purché il _ non sia seguito da una lettera maiuscola.

source: So clearly `TestSuiteName` and `TestName` cannot start or end with `_` (Actually, `TestSuiteName` can start with `_`—as long as the `_` isn't followed by an upper-case letter.
it_it: Quindi chiaramente `TestSuiteName` e `TestName` non possono iniziare o finire con `_` (In realtà, `TestSuiteName` può iniziare con `_`—purché il `_` non sia seguito da una lettera maiuscola.

source: So far we've only shown examples where you have a single expectation.
it_it: Finora abbiamo mostrato solo esempi con una sola expectation.

source: So for simplicity we just say that it cannot start with _.).
it_it: Quindi per semplicità diciamo semplicemente che non può iniziare con _.).

source: So for simplicity we just say that it cannot start with `_`.).
it_it: Quindi per semplicità diciamo che non può iniziare con `_`).

source: So for simplicity, we just ask the users to avoid _ in TestSuiteName and TestName.
it_it: Quindi, per semplicità, chiediamo agli utenti di evitare _ in TestSuiteName e in TestName.

source: So for simplicity, we just ask the users to avoid `_` in `TestSuiteName` and `TestName`.
it_it: Quindi, per semplicità, chiediamo agli utenti di evitare `_` in `TestSuiteName` e in `TestName`.

source: So how do we tell gMock that GetDomainOwner() can be called with some other arguments as well?
it_it: Allora come diciamo a gMock che GetDomainOwner() può essere chiamato anche con altri argomenti?

source: So how do we tell gMock that `GetDomainOwner()` can be called with some other arguments as well?
it_it: Allora come diciamo a gMock che `GetDomainOwner()` può essere chiamato anche con altri argomenti?

source: So in Listing 14, the SetUp (please use proper spelling here) routine is called twice because two myFixture1 objects are created.
it_it: Pertanto, nel Listato 14, la routine SetUp (usare l'ortografia corretta qui) viene chiamata due volte perché vengono creati due oggetti myFixture1.

source: So let's go!
it_it: Quindi andiamo!

source: So making a mock strict may change the test's result.
it_it: Quindi rendere un mock strict può cambiare il risultato del test.

source: So please be aware of the different definitions of the terms:
it_it: Si prega quindi di prestare attenzione alle diverse definizioni dei termini:

source: So the first thing you can try is to eliminate creating threads outside of EXPECT_DEATH().
it_it: Quindi la prima cosa che si può provare è eliminare la creazione di thread al di fuori di EXPECT_DEATH().

source: So the first thing you can try is to eliminate creating threads outside of `EXPECT_DEATH()`.
it_it: Quindi la prima cosa che si può provare è eliminare la creazione di thread al di fuori di `EXPECT_DEATH()`.

source: So the right answer is that turtle.GetY() will return 100 the first time, but return 0 from the second time on, as returning 0 is the default action for int functions.
it_it: Quindi la risposta giusta è che turtle.GetY() restituirà 100 la prima volta, ma restituirà 0 dalla seconda volta in poi, poiché restituire 0 è l'azione predefinita per le funzioni int.

source: So the right answer is that `turtle.GetY()` will return 100 the first time, but **return 0 from the second time on**, as returning 0 is the default action for `int` functions.
it_it: Quindi la risposta giusta è che `turtle.GetY()` restituirà 100 la prima volta, ma **restituirà 0 dalla seconda volta in poi**, poiché restituire 0 è l'azione di default per le funzioni `int`.

source: So use ON_CALL by default, and only use EXPECT_CALL when you actually intend to verify that the call is made.
it_it: Quindi usare ON_CALL per default e usare EXPECT_CALL solo quando si intende effettivamente verificare che la chiamata sia stata effettuata.

source: So use `ON_CALL` by default, and only use `EXPECT_CALL` when you actually intend to verify that the call is made.
it_it: Quindi usare `ON_CALL` per default e usare `EXPECT_CALL` solo quando si intende effettivamente verificare che la chiamata sia stata effettuata.

source: So what makes a good test, and how does GoogleTest fit in?
it_it: Quindi cosa rende buon un test e come si inserisce GoogleTest?

source: So you can use a lambda:
it_it: Poi si può usare una lambda:

source: So, unlike with many other C++ testing frameworks, you don't have to re-list all your defined tests in order to run them.
it_it: Pertanto, a differenza di molti altri framework di test C++, non è necessario elencare nuovamente tutti i test definiti per eseguirli.

source: So, if you have two expectations on the same method, you want to put the one with more specific matchers after the other, or the more specific rule would be shadowed by the more general one that comes after it.
it_it: Quindi, se si hanno due expectation sullo stesso metodo, si vuol mettere quella con matcher più specifici dopo l'altra, altrimenti la regola più specifica verrebbe oscurata da quella più generale che viene dopo.

source: So, if you have two expectations on the same method, you want to put the one with more specific matchers **after** the other, or the more specific rule would be shadowed by the more general one that comes after it.
it_it: Quindi, se si hanno due expectation sullo stesso metodo, si vuol mettere quella con matcher più specifici **dopo** l'altra, altrimenti la regola più specifica verrebbe oscurata da quella più generale che viene dopo.

source: So, in addition to per-test set-up/tear-down, GoogleTest also supports per-test-suite set-up/tear-down.
it_it: Pertanto, oltre alla configurazione/dismissione per ogni test, GoogleTest supporta anche la configurazione/dismissione per ogni test suite.

source: So, sometimes you do want to *force* gMock to verify a mock object before it is (hopefully) destructed.
it_it: Quindi, a volte si vuole *forzare* gMock a verificare un oggetto mock prima che venga (si spera) distrutto.

source: So, sometimes you do want to force gMock to verify a mock object before it is (hopefully) destructed.
it_it: Quindi, a volte si vuole forzare gMock a verificare un oggetto mock prima che venga (si spera) distrutto.

source: So, the second time turtle.GetX() is called, the last (latest) EXPECT_CALL() statement will match, and will immediately lead to an "upper bound violated" error - this piece of code is not very useful!
it_it: Pertanto, la seconda volta che viene chiamato turtle.GetX(), l'ultima (più recente) istruzione EXPECT_CALL() corrisponderà e porterà immediatamente a un errore di "upper bound violated": questo pezzo di codice non è molto utile!

source: So, the second time `turtle.GetX()` is called, the last (latest) `EXPECT_CALL()` statement will match, and will immediately lead to an "upper bound violated" error - this piece of code is not very useful!
it_it: Pertanto, la seconda volta che viene chiamato `turtle.GetX()`, l'ultima (più recente) istruzione `EXPECT_CALL()` corrisponderà e porterà immediatamente a un errore di "upper bound violated": questo pezzo di codice non è molto utile!

source: So, to specify the partial order on the expectations we need to do two things: first to define some Sequence objects, and then for each EXPECT_CALL() say which Sequence objects it is part of.
it_it: Quindi, per specificare l'ordine parziale sulle expectation dobbiamo fare due cose: prima definire degli oggetti Sequence, e poi per ciascuna EXPECT_CALL() dire si quale oggetto Sequence fa parte.

source: So, to specify the partial order on the expectations we need to do two things: first to define some `Sequence` objects, and then for each `EXPECT_CALL()` say which `Sequence` objects it is part of.
it_it: Quindi, per specificare l'ordine parziale sulle expectation dobbiamo fare due cose: prima definire degli oggetti `Sequence`, e poi per ciascuna `EXPECT_CALL()` dire si quale oggetto `Sequence` fa parte.

source: So, what shall you do?
it_it: Allora, cosa si farà?

source: So, what's wrong in the latter case?
it_it: Quindi, cosa c'è che non va in quest'ultimo caso?

source: So, when you see the message and believe that there shouldn't be any uninteresting calls, you should investigate what's going on.
it_it: Quindi, quando si vede il messaggio e si crede che non dovrebbero esserci chiamate poco interessanti, si dovrebbe indagare su cosa sta succedendo.

source: So, you can invoke something whose type is *not* exactly the same as the mock function, as long as it's safe to do so - nice, huh?
it_it: Quindi, si può invocare qualcosa il cui tipo *non* sia esattamente lo stesso della funzione mock, purché sia sicuro farlo: bello, eh?

source: So, you can invoke something whose type is not exactly the same as the mock function, as long as it's safe to do so - nice, huh?
it_it: Quindi, si può invocare qualcosa il cui tipo non sia esattamente lo stesso della funzione mock, purché sia sicuro farlo: bello, eh?

source: So, you can make a method do different things depending on its argument values like this:
it_it: Quindi, si può fare in modo che un metodo faccia cose diverse a seconda dei valori dei suoi argomenti in questo modo:

source: Solution 1 - wrap with parentheses:
it_it: Soluzione 1 - racchiudere tra le parentesi:

source: Solution 2 - define an alias:
it_it: Soluzione 2 - definire un alias:

source: Some rough guidelines:
it_it: Alcune linee guida approssimative:

source: Some GoogleTest macros may return from the current function (e.g. ASSERT_TRUE()), so be sure to avoid them in statement.
it_it: Alcune macro di GoogleTest potrebbero restituire dalla funzione corrente (ad esempio ASSERT_TRUE()), quindi sono da evitarle in statement.

source: Some GoogleTest macros may return from the current function (e.g. `ASSERT_TRUE()`), so be sure to avoid them in `statement`.
it_it: Alcune macro di GoogleTest potrebbero restituire dalla funzione corrente (ad esempio `ASSERT_TRUE()`), quindi sono da evitarle in `statement`.

source: Some categories of tests have bad memory problems that surface only during certain runs.
it_it: Alcune categorie di test presentano gravi problemi di memoria che emergono solo durante determinate esecuzioni.

source: Some examples are shown here:
it_it: Alcuni esempi sono mostrati qui:

source: Some floating-point operations are useful, but not that often used.
it_it: Alcune operazioni in virgola mobile sono utili, ma non vengono utilizzate tanto spesso.

source: Some of the simpler assertions include ASSERT_TRUE (condition) and ASSERT_NE (val1, val2).
it_it: Alcune delle asserzioni più semplici includono ASSERT_TRUE (condition) e ASSERT_NE (val1, val2).

source: Some other times, you are debugging your tests or learning about the behavior of the code you are testing, and wish you could observe every mock call that happens (including argument values, the return value, and the stack trace).
it_it: Altre volte, si sta eseguendo il debug dei test o si sta imparando il comportamento del codice in esame e si vorrebbe poter osservare ogni chiamata mock che avviene (inclusi i valori degli argomenti, il valore restituito e il trace dello stack).

source: Some people had been ignoring the return value of RUN_ALL_TESTS().
it_it: Qualcuno ha ignorato il valore restituito da RUN_ALL_TESTS().

source: Some people had been ignoring the return value of `RUN_ALL_TESTS()`.
it_it: Qualcuno ha ignorato il valore restituito da `RUN_ALL_TESTS()`.

source: Some people like to call this style of syntax a Domain-Specific Language (DSL).
it_it: A qualcuno piace chiamare questo stile di sintassi un Domain-Specific Language (DSL).

source: Some people put it in a _test.cc.
it_it: Qualcuno le mette in un _test.cc.

source: Some people put it in a `_test.cc`.
it_it: Qualcuno le mette in un `_test.cc`.

source: Some people worry that if everyone is practicing this technique, they will end up writing lots of redundant code.
it_it: Qualcuno teme che se tutti praticassero questa tecnica, si finirebbe per scrivere molto codice ridondante.

source: Some subset of argument matches UnorderedElementsAre(expected matchers).
it_it: Alcuni sottoinsiemi di argument corrispondono a UnorderedElementsAre(matcher attesi).

source: Some subset of `argument` matches `UnorderedElementsAre(`expected matchers`)`.
it_it: Alcuni sottoinsiemi di `argument` corrispondono a `UnorderedElementsAre(`expected matchers`)`.

source: Some times you have a non-trivial fake implementation of an interface.
it_it: Talvolta si hanno implementazioni [fake] non banali di un'interfaccia.

source: Some tips on using SCOPED_TRACE:
it_it: Alcuni suggerimenti sull'utilizzo di SCOPED_TRACE:

source: Some tips on using `SCOPED_TRACE`:
it_it: Alcuni suggerimenti sull'utilizzo di `SCOPED_TRACE`:

source: Someone has to implement the mocks.
it_it: Qualcuno deve implementare i mock.

source: Sometimes a function may need to know the name of the currently running test.
it_it: A volte una funzione potrebbe aver bisogno di conoscere il nome del test attualmente in esecuzione.

source: Sometimes a method exhibits its effect not via returning a value but via side effects.
it_it: A volte un metodo mostra il suo effetto non restituendo un valore ma tramite degli effetti collaterali.

source: Sometimes a method has a long list of arguments that is mostly uninteresting.
it_it: A volte un metodo ha un lungo elenco di argomenti che nella maggior parte dei casi non sono interessanti.

source: Sometimes a mock function will receive a function pointer, a functor (in other words, a "callable") as an argument, e.g.
it_it: A volte una funzione mock riceverà un puntatore a funzione, un funtore (in altre parole, un "callable") come argomento, ad es.

source: Sometimes an STL container (e.g. list, vector, map, ...) is passed to a mock function and you may want to validate it.
it_it: A volte un container STL (ad esempio lista, vettore, mappa, ...) viene passato a una funzione mock e lo si vorrebbe convalidare.

source: Sometimes an expectation's state didn't change between two failures, and you'll see the same description of the state twice.
it_it: A volte lo stato di una expectation non cambia tra due fallimenti e si vedrà la stessa descrizione dello stato due volte.

source: Sometimes it is necessary to list the available tests in a program before running them so that a filter may be applied if needed.
it_it: A volte è necessario elencare i test disponibili in un programma prima di eseguirli in modo da poter applicare un filtro, se necessario.

source: Sometimes it's not enough to match the arguments individually.
it_it: A volte non è sufficiente abbinare [match] gli argomenti individualmente.

source: Sometimes requiring everything to occur in a predetermined order can lead to brittle tests.
it_it: A volte richiedere che tutto avvenga in un ordine predeterminato può portare a test fragili.

source: Sometimes that can be a problem.
it_it: A volte questo può essere un problema.

source: Sometimes the line number of the trace point is enough for identifying the particular invocation of a sub-routine.
it_it: A volte il numero di riga del punto del trace è sufficiente per identificare la particolare invocazione di una subroutine.

source: Sometimes they work great, and sometimes you may find them, well, a pain to use.
it_it: A volte funzionano alla grande, a volte potresti trovarli, beh, difficili da usare.

source: Sometimes this is impossible as some library you must use may be creating threads before main() is even reached.
it_it: A volte questo è impossibile poiché alcune librerie da utilizzare potrebbero creare thread prima ancora che venga raggiunto il main().

source: Sometimes this is impossible as some library you must use may be creating threads before `main()` is even reached.
it_it: A volte questo è impossibile poiché alcune librerie da utilizzare potrebbero creare thread prima ancora che venga raggiunto il `main()`.

source: Sometimes you are confident that your tests are correct and may not appreciate such friendly messages.
it_it: A volte si è sicuri che i test siano corretti e si potrebbe non apprezzare messaggi così amichevoli.

source: Sometimes you have an action that returns *something*, but you need an action that returns `void` (perhaps you want to use it in a mock function that returns `void`, or perhaps it needs to be used in `DoAll()` and it's not the last in the list).
it_it: A volte si ha un'azione che restituisce *qualcosa*, ma c'è bisogno di un'azione che restituisca `void` (forse per usarla in una funzione mock che restituisca `void`, o forse deve essere utilizzato in `DoAll()` e non è l'ultimo della lista).

source: Sometimes you have an action that returns something, but you need an action that returns void (perhaps you want to use it in a mock function that returns void, or perhaps it needs to be used in DoAll() and it's not the last in the list).
it_it: A volte si ha un'azione che restituisce qualcosa, ma c'è bisogno di un'azione che restituisca void (forse per usarla in una funzione mock che restituisca void, o forse deve essere utilizzato in DoAll() e non è l'ultimo della lista).

source: Sometimes you may have a function that takes more arguments, and you are willing to pass in the extra arguments yourself to fill the gap.
it_it: A volte si potrebbe avere una funzione che accetta più argomenti e si è disposti a passare manualmente gli argomenti extra per colmare il divario.

source: Sometimes you may want to instead return the live value of x (i.e. its value at the time when the action is executed.).
it_it: A volte si vorrebbe restituire invece il valore live di x (ovvero il suo valore nel momento in cui l'azione viene eseguita.).

source: Sometimes you may want to call Foo::Concrete() instead of MockFoo::Concrete().
it_it: A volte si vorrebbe chiamare Foo::Concrete() invece di MockFoo::Concrete().

source: Sometimes you may want to call `Foo::Concrete()` instead of `MockFoo::Concrete()`.
it_it: A volte si vorrebbe chiamare `Foo::Concrete()` invece di `MockFoo::Concrete()`.

source: Sometimes you may want to define value-parameterized tests in a library and let other people instantiate them later.
it_it: A volte si vorrebbero definire test con valori parametrizzati in una libreria e consentire ad altre persone di crearne un'istanza successivamente.

source: Sometimes you may want to instead return the *live* value of `x` (i.e. its value at the time when the action is *executed*.).
it_it: A volte si vorrebbe restituire invece il valore *live* di `x` (ovvero il suo valore nel momento in cui l'azione viene *eseguita*.).

source: Sometimes you might want to test a mock object's behavior in phases whose sizes are each manageable, or you might want to set more detailed expectations about which API calls invoke which mock functions.
it_it: A volte si deve testare il comportamento di un oggetto mock in fasi le cui dimensioni sono gestibili, oppure si devono impostare expectation più dettagliate su quali chiamate API richiamano quali funzioni mock.

source: Sometimes you want precise control on what types of functions the action can be used in, and implementing ActionInterface is the way to go here.
it_it: A volte si vuole un controllo preciso sui tipi delle funzioni in cui può essere utilizzata l'azione e implementare ActionInterface è la strada da percorrere in questo caso.

source: Sometimes you want precise control on what types of functions the action can be used in, and implementing `ActionInterface` is the way to go here.
it_it: A volte si vuole un controllo preciso sui tipi delle funzioni in cui può essere utilizzata l'azione e implementare `ActionInterface` è la strada da percorrere in questo caso.

source: Sometimes you want to give an action explicit template parameters that cannot be inferred from its value parameters.
it_it: A volte è necessario fornire a un'azione parametri template espliciti che non possono essere dedotti dai parametri del valore.

source: Sometimes you want to make sure a mock object is destructed at the right time, e.g. after bar->A() is called but before bar->B() is called.
it_it: A volte si vuol verificare che un oggetto mock venga distrutto al momento giusto, ad es. dopo la chiamata a bar->A() ma prima di chiamare bar->B().

source: Sometimes you want to make sure a mock object is destructed at the right time, e.g. after `bar->A()` is called but before `bar->B()` is called.
it_it: A volte si vuol verificare che un oggetto mock venga distrutto al momento giusto, ad es. dopo la chiamata a `bar->A()` ma prima di chiamare `bar->B()`.

source: Sometimes you'll want to define a matcher that has parameters.
it_it: A volte servirà un matcher che abbia parametri.

source: Sometimes you'll want to parameterize an action you define.
it_it: Talvolta si vuole parametrizzare una action che si definisce.

source: Sometimes, you want to run only a subset of the tests (e.g. for debugging or quickly verifying a change).
it_it: A volte, se ne vogliono eseguire solo un sottoinsieme (ad esempio per eseguire il debug o verificare rapidamente una modifica).

source: Sometimes, AbslStringify() might not be an option: your team may wish to print types with extra debugging information for testing purposes only.
it_it: A volte, AbslStringify() potrebbe non essere un'opzione: il team potrebbe voler stampare tipi con informazioni di debug aggiuntive solo a scopo di test.

source: Sometimes, `AbslStringify()` might not be an option: your team may wish to print types with extra debugging information for testing purposes only.
it_it: A volte, `AbslStringify()` potrebbe non essere un'opzione: il team potrebbe voler stampare tipi con informazioni di debug aggiuntive solo a scopo di test.
